javascript_form/app/views/posts/_post.html.erb

SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [[nil, 1]]
---
<td> <%= button_to 'Like', like_post_path(post), remote: true %></td>
<span id="like-<%= post.id %>"><td> <%= pluralize(post.likes.count, "like") %></td></span>