javascript_form/app/views/posts/like.js.erb

SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 1]]
---
$("#like-<%= @post.id %>").text("<%= pluralize(@post.likes.count, 'like') %>")