javascript_form/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
     @post = Post.new
     @posts = Post.all

INSERT INTO "posts" ("name", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Melissa"], ["body", "hello"], ["created_at", "2015-04-01 19:39:16.712012"], ["updated_at", "2015-04-01 19:39:16.712012"]]
---
  def create
     @post = Post.new(post_params)
     respond_to do |format|
        if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "likes" ("post_id") VALUES (?)  [["post_id", 1]]
---
  def like
     @post = Post.find(params[:id])
     @post.likes.create